brilliant.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://example.com/rss.xml"
      title="RSS feed for https://example.com/">
<title>Brilliant</title>
</head>
<body>
<div id="preamble" class="status"></div>
<div id="content">
<div class="post-date">15 Jun 2013</div><h1 class="post-title"><a href="https://example.com/brilliant.html">Brilliant</a></h1>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2912871">1. Brilliant!</a>
<ul>
<li><a href="#org5663506">1.1. Some Confusion</a></li>
<li><a href="#org72393f4">1.2. What I've Learned So Far</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-org2912871" class="outline-2">
<h2 id="org2912871"><span class="section-number-2">1.</span> Brilliant!</h2>
<div class="outline-text-2" id="text-1">
<p>
I've been using text mode to write these blog entries. Additionally, I
have been using <a href="http://www.daringfireball.net/projects/markdown/">markdown</a> to format
them. As I do not have markdown enabled yet in emacspeak and because I
am unable to install pandoc on the pi, I've been copying them to my
Vinux machine for processing and posting.
</p>

<p>
I've discovered how to create a web page and convert it to html. This
post is a test case. 
</p>
</div>
<div id="outline-container-org5663506" class="outline-3">
<h3 id="org5663506"><span class="section-number-3">1.1.</span> Some Confusion</h3>
<div class="outline-text-3" id="text-1-1">
<p>
In reading Alex's <a href="http://emacspeak.sourceforge.net/info/html/tutorial.html">explanation</a>, I was confused because he talks about creating a web page. This "page" (I've surrounded the word page with quotation marks.) is not something which is published on the web. It is a file a browser can read and interpret. What Alex has you do is write a file that acts as a list of bookmarks to your favorite sites so you can launch it and get around the web quickly and easily. fterI understood this, his explanations made a lot more sense.
</p>

<p>
<b>Note:</b> The extension ".org" refers to org mode not the domain type as in "raspberryvi.org". This also confused me. I thought at first org mode was not installed, but that is because I was hearing "aug" mode as in "augmented" or ""August". It's "org" as in "organized".
</p>
</div>
</div>
<div id="outline-container-org72393f4" class="outline-3">
<h3 id="org72393f4"><span class="section-number-3">1.2.</span> What I've Learned So Far</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Sadly, my menu structure is different from the one described so I'm reading the <a href="http://orgmode.org/manual/index.html">Org Manual</a>. 
</p>

<p>
One of the exciting discoveries I've made says You can publish this file and there will be navigation as part of the publishing process. I'm currently reading the manual and each section of the book is a separate page with navigation to other sections built in.
</p>

<p>
I've looked at the html code generated and it is overly fussy. I'll try it with tidy and see what happens. s the code is correct, tidy has no effect. 
</p>

<p>
I'm publishing the full html that was generated including the preamble and postamble. I am not sure how to disable this. 
</p>
</div>
</div>
</div>
<div class="taglist"></div></div>
<div id="postamble" class="status"></div>
</body>
</html>
